In [1]:
import pandas as pd
import numpy as np

a = np.array([1,2,3,4,5,6,7,8,9])
aSeries = pd.Series(a)
aSeries

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int32

In [2]:
aDataFrame = pd.DataFrame([[1,2], [3,4], [4,5]], columns=['A', 'B'])
aDataFrame

   A  B
0  1  2
1  3  4
2  4  5

In [3]:
aDataFrame.head(1)        #Untuk melimit data tertentu

   A  B
0  1  2

In [4]:
aDataFrame.tail(1)        #Untuk mengambil data terakhir

   A  B
2  4  5

In [5]:
aDataFrame['A']

0    1
1    3
2    4
Name: A, dtype: int64

In [6]:
type(aDataFrame['A'])

pandas.core.series.Series

In [7]:
import pandas as pd
import numpy as np

# Series
aa = [9,2,5,3,4,5,7,4,3,5,7]
ab = pd.Series(np.array(aa))

ac = ['Andi', 'Budi', 'Caca']
ad = pd.Series(np.array(ac))
type(ab)

pandas.core.series.Series

In [8]:
ab

0     9
1     2
2     5
3     3
4     4
5     5
6     7
7     4
8     3
9     5
10    7
dtype: int32

In [9]:
ad

0    Andi
1    Budi
2    Caca
dtype: object

In [10]:
# Merubah isi Index
ac = ['Andi', 'Budi', 'Caca', 'Doni', 'Elis']
ad = pd.Series(np.array(ac), index = ['I', 'II', 'III', 'IV', 'V'])
ad

I      Andi
II     Budi
III    Caca
IV     Doni
V      Elis
dtype: object

In [11]:
# Menambahkan nama pada data
ae = pd.Series(
    np.array(ac), 
    index = ['I', 'II', 'III', 'IV', 'V'],
    name  = 'Test'
)
ae

I      Andi
II     Budi
III    Caca
IV     Doni
V      Elis
Name: Test, dtype: object

In [12]:
# Memasukkan data
af = pd.Series(
    data = {'a': 2, 'b': 3},
    name  = 'Test'
)
af

a    2
b    3
Name: Test, dtype: int64

In [13]:
# Data Frame
ag = [2,4,6,8,10]
ah = pd.DataFrame(ag, columns=['Nilai'])
ah.shape     #Untuk mendapatkan (baris, kolom)

(5, 1)

In [14]:
ah

   Nilai
0      2
1      4
2      6
3      8
4     10

In [15]:
# Data Frame
ai = [2,4,6,8,10]
aj = [1,3,5,7,9]
ak = pd.DataFrame([ai,aj])
ak       # Hasil tabel berbentuk bertumpuk

   0  1  2  3   4
0  2  4  6  8  10
1  1  3  5  7   9

In [16]:
ai = [2,4,6,8,10]
aj = [1,3,5,7,9]
Merge = list(map(lambda x,y: [x,y], ai, aj))
Out   = pd.DataFrame(Merge)
Out      # Hasil tabel lebih rapi

    0  1
0   2  1
1   4  3
2   6  5
3   8  7
4  10  9

In [17]:
# Memberikan nama pada Kolom
Out2 = pd.DataFrame()
Out2['X'] = ai
Out2['Y'] = aj
Out2

    X  Y
0   2  1
1   4  3
2   6  5
3   8  7
4  10  9

In [18]:
# Menambahkan konten
z = list('david')
Out2['Z'] = z
Out2

    X  Y  Z
0   2  1  d
1   4  3  a
2   6  5  v
3   8  7  i
4  10  9  d

In [20]:
# Memanggil Kolom
Out[1]

0    1
1    3
2    5
3    7
4    9
Name: 1, dtype: int64